

//Ag(T+D) 3475.00 -0.03%  981740  3475.00 3479.00 3483.00 3463.00 2015-06-13 02:28:17
//Au(T+D) 235.91  -0.07%  8018    236.10  236.34  236.40  235.30  2015-06-13 02:28:16
//Au(T+N1)    235.95  -0.19%  140 235.70  236.45  236.35  235.60  2015-06-13 02:28:10
//Au(T+N2)    0.00    0.00%   0   0.00    239.65  0.00    0.00    2015-06-13 02:28:10
//mAu(T+D)    236.30  0.05%   7330    236.49  236.56  236.50  235.50  2015-06-13 02:28:10
//Au100g  236.89  0.03%   28  239.00  236.82  239.00  236.00  2015-06-13 02:28:10
//Au99.95 0.00    0.00%   0   0.00    236.12  0.00    0.00    2015-06-13 02:28:10
//Au99.99 236.50  0.04%   67604   236.55  236.41  236.65  235.60  2015-06-13 02:28:10
//iAu100g 0.00    0.00%   0   0.00    235.00  0.00    0.00    2015-06-13 02:28:10
//iAu99.99    0.00    0.00%   0   0.00    236.20  0.00    0.00    2015-06-13 02:28:10
//品种  当前价 涨跌方向    涨跌幅 成交量(手)  开盘价 昨收价 最高价 最低价 更新时间

import java.util.Date

class PriceStamp(val species: String, val currentPrice: String,
        val increasePercent: String, val dealNum: Integer, 
        val openPrice: Float, val lastClosedPrice: Float, 
        val priceHigh: Float, val priceLow: Float, val dateTime: Date) {

}
